; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 2602)
	(= (fuel plane1) 186)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city3)
	(= (capacity plane2) 9496)
	(= (fuel plane2) 932)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 12)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city6)
	(= (capacity plane3) 3074)
	(= (fuel plane3) 143)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 3)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at person1 city3)
	(at person2 city6)
	(at person3 city1)
	(at person4 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 992)
	(= (distance city0 city2) 632)
	(= (distance city0 city3) 569)
	(= (distance city0 city4) 842)
	(= (distance city0 city5) 509)
	(= (distance city0 city6) 612)
	(= (distance city1 city0) 992)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 818)
	(= (distance city1 city3) 586)
	(= (distance city1 city4) 650)
	(= (distance city1 city5) 775)
	(= (distance city1 city6) 517)
	(= (distance city2 city0) 632)
	(= (distance city2 city1) 818)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 839)
	(= (distance city2 city4) 521)
	(= (distance city2 city5) 783)
	(= (distance city2 city6) 977)
	(= (distance city3 city0) 569)
	(= (distance city3 city1) 586)
	(= (distance city3 city2) 839)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 768)
	(= (distance city3 city5) 925)
	(= (distance city3 city6) 903)
	(= (distance city4 city0) 842)
	(= (distance city4 city1) 650)
	(= (distance city4 city2) 521)
	(= (distance city4 city3) 768)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 773)
	(= (distance city4 city6) 829)
	(= (distance city5 city0) 509)
	(= (distance city5 city1) 775)
	(= (distance city5 city2) 783)
	(= (distance city5 city3) 925)
	(= (distance city5 city4) 773)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 641)
	(= (distance city6 city0) 612)
	(= (distance city6 city1) 517)
	(= (distance city6 city2) 977)
	(= (distance city6 city3) 903)
	(= (distance city6 city4) 829)
	(= (distance city6 city5) 641)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane3 city2)
	(at person1 city2)
	(at person2 city0)
	(at person4 city6)
	))

(:metric minimize (+ (* 1 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane3 city6)
   changed: (fuel plane3) from 143 to 3074
   goals met: 0 of 5
2. (refuel plane1 city1)
   changed: (fuel plane1) from 186 to 2602
   goals met: 0 of 5
3. (fly plane3 city6 city3)
   deleted: (at plane3 city6)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 0 to 903, (fuel plane3) from 3074 to 2171
   goals met: 0 of 5
4. (zoom plane1 city1 city6)
   deleted: (at plane1 city1)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 903 to 2454, (fuel plane1) from 2602 to 1051
   goals met: 0 of 5
5. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 5
6. (board person2 plane1 city6)
   deleted: (at person2 city6)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 5
7. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2454 to 3066, (fuel plane1) from 1051 to 439
   goals met: 1 of 5
8. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 5
9. (fly plane3 city3 city4)
   deleted: (at plane3 city3)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 3066 to 3834, (fuel plane3) from 2171 to 1403
   goals met: 2 of 5
10. (board person4 plane3 city4)
   deleted: (at person4 city4)
   added: (in person4 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 2 of 5
11. (fly plane3 city4 city6)
   deleted: (at plane3 city4)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 3834 to 4663, (fuel plane3) from 1403 to 574
   goals met: 2 of 5
12. (debark person4 plane3 city6)
   deleted: (in person4 plane3)
   added: (at person4 city6)
   changed: (onboard plane3) from 2 to 1
   goals met: 3 of 5
13. (refuel plane3 city6)
   changed: (fuel plane3) from 574 to 3074
   goals met: 3 of 5
14. (fly plane3 city6 city2)
   deleted: (at plane3 city6)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 4663 to 5640, (fuel plane3) from 3074 to 2097
   goals met: 4 of 5
15. (debark person1 plane3 city2)
   deleted: (in person1 plane3)
   added: (at person1 city2)
   changed: (onboard plane3) from 1 to 0
   goals met: 5 of 5
